Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: དབེན་པར་གཙང་མའི་གོས་གྱོན་ཏེ། །དཀྱིལ་འཁོར་ཅི་རན་བྱས་པ་དེར། །བུམ་པ་རྒྱས་པ་བཞི་བཞག་སྟེ། །
en: “Wear clean clothes in a solitary place, And in a maṇḍala of whatever size you can make Place four vases that are extensive.

source: དུས་བཞིན་མེ་ཏོག་བདུག་པས་མཆོད། །
en: At that time, offer flowers and incense.

source: བ་དན་གདུགས་དང་ལྡ་ལྡི་བྲེ། །ཕྱེ་མ་བྱུག་པས་རྒྱས་པར་བརྒྱན། །
en: “Beautify it with flags, parasols, and streamers, And adorn it extensively with ointments and powders.

source: སངས་རྒྱས་དང་ནི་དབྱངས་ཅན་མཆོད། །ལྷ་དེ་མཐོང་འདོད་མཐོང་བར་འགྱུར། །
en: Make offerings to the buddhas and Sarasvatī, And if you wish to see that deity, you will see her.

source: དབྱངས་ཅན་ལྷ་མོ་དེ་མདུན་དུ། །ཞག་བདུན་གསུམ་དུ་བཟླས་བརྗོད་དེ། །
en: “In front of the goddess Sarasvatī Recite and repeat this for three weeks.

source: གལ་ཏེ་ལྷ་དེ་མ་མཐོང་ན། །བསམ་པ་བརྟན་པས་ཞག་དགུར་བཟླས། །
en: If you still have not seen that deity, Repeat with a stable mind for nine more days.

source: དེ་ཡི་ནུབ་མོའང་མ་མཐོང་ན། །གཞན་དུ་ཤིས་པའི་གནས་བཙལ་ཏེ། །
en: “If she has not been seen in those nights, Seek another auspicious place.

source: ཚུལ་བཞིན་ལྷ་མོའི་གཟུགས་བྲིས་ལ། །མཆོད་ཅིང་བཟླས་བརྗོད་རྒྱུན་མི་གཅད། །
en: Draw a correct image of the goddess And continuously offer, repeat, and recite.

source: བདག་དང་གཞན་དོན་ཚད་མེད་ལ། །ཉིན་མཚན་རྒྱུན་ཏུ་བརྩོན་བསྐྱེད་དེ། །
en: “Day and night make a continuous effort For an immeasurable benefit to yourself and others.

source: དེ་ཡི་འབྲས་བུ་གཞན་ལ་སྟོབས། །དེ་ནི་བསམ་པ་འགྲུབ་པར་འགྱུར། །
en: Its result will be bestowed on others And your wishes will be accomplished.

source: དེ་སྟེའང་བསམ་པ་མ་གྲུབ་ན། །ཟླ་བ་གསུམ་དང་དྲུག་དང་དགུ། །ཡང་ན་བརྩོན་པས་ལོར་བཟླས་ན། །མངོན་ཤེས་དྲུག་ལ་སོགས་པའང་འཐོབ། །
en: “If in that way your wishes have not been accomplished, Then for three months, or for six months, or nine, Or with diligent mantra repetition for a year, You will attain the six higher cognitions, and so on.”

source: དེ་ནས་བྲམ་ཟེ་ཀཽཎྜི་ནྱས། དེ་སྐད་ཅེས་བཤད་པ་ཐོས་ནས་དགའ་བ་དང་། རངས་པ་ཚད་མེད་པ་སྐྱེས་ཏེ། འཁོར་འདུས་པ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་དང་མི་ལ་སོགས་པའི་འཁོར་ཐམས་ཅད་ཀྱིས།
en: The Kauṇḍinya brahmin, on hearing that teaching, felt immeasurable joy and delight, and he said to that gathered assembly: “This entire assembly of devas, humans, and others, Listen to me with undistracted minds.

source: སེམས་མ་གཡེང་བར་བདག་ལ་ཉོན་ཅིག་དང་། བདག་གིས་ཀུན་རྫོབ་ཀྱི་བདེན་པ་ལ་བརྟེན་ཏེ། དབྱངས་ཅན་ལྷ་མོ་མཆོག་ལ་བསྟོད་པའི་ཕྱིར། ཚིགས་སུ་བཅད་དེ་སྨྲ་བར་བགྱིའོ། །
en: I will recite these verses Based upon relative truth, In order to praise the supreme goddess Sarasvatī.

source: ཕྱག་འཚལ་ལྷ་མོ་མཐུ་ཆེན་ལ། །འཇིག་རྟེན་ཁམས་འདིར་དབང་བརྙེས་པར། །
en: “I pay homage to the goddess with great power, Who has attained power over this world realm.

source: སྔོན་གྱི་དྲང་སྲོང་གིས་བཤད་པས། །དེ་ཕྱིར་བདག་གིས་ཁྱོད་ལ་བསྟོད། །
en: I am going to praise you because This has been taught by the ṛṣis of the past.

source: དཔལ་ལྡན་ཐུགས་ནི་བདེ་བ་དང་། །ཐོས་འཛིན་མཛེས་ལྡན་གྲགས་ལྡན་པ། །
en: “Your glorious mind possesses bliss and learning And it is renowned for its beauty.

source: འཇིག་རྟེན་འདི་སྐྱེད་ཡུམ་ཡང་ཡིན། །རྟག་ཏུ་དཔལ་ལ་བརྩོན་ཆེན་སྤྱོད། །
en: You are also the mother who gave birth to this world And continuously acts with great diligence in glory.

source: གཡུལ་གྱི་གནས་ལས་རྟག་ཏུ་རྒྱལ། །
en: “You are always victorious on the battleground.

source: སྙིང་རྗེ་བཟོད་ལ་དུལ་བས་བསྐྱེད། །གཤིན་རྗེའི་སྲིང་མོར་ལུས་སྟོན་ཅིང་། །རྟག་ཏུ་དར་གོས་སྔོན་པོ་མནབས། །
en: Through subjugation you give rise to compassion and patience, You manifest the body of Yama’s sister, And you always wear clothes of blue silk.

source: མཛེས་དང་མི་མཛེས་ཀུན་སྟོན་ཅིང་། །
en: “You manifest both beauty and ugliness.

source: སྤྱན་མིག་སུས་མཐོང་དང་བ་སྐྱེད། །
en: Whoever sees your eyes will have trust in you.

source: སྤྱོད་པ་ཚད་མེད་འཇིག་རྟེན་འདས། །
en: Your immeasurable activity transcends the world.

source: སྐྱབས་སུ་སུ་འོངས་རྗེས་སུ་འཛིན། །
en: Whoever comes to you for refuge, you take care of them.

source: བར་འགའ་རི་དང་བྲག་ལ་གནས། །བར་འགའ་ཕུག་དང་ཆུ་བོའི་འགྲམ། །ཡང་ན་ལྗོན་སྡོང་ནགས་རྣམས་སུ། །གནས་དེ་དག་ནི་ལྷ་མོའི་རྟེན། །
en: “Sometimes you dwell on mountains and rocks, Sometimes in caves or on riverbanks, Or also within forests of trees— Those places are the dwellings of the goddess.

source: ཅི་ལྟར་རི་བྲགས་མི་རྣམས་ཀྱིས། །རྨ་བྱའི་མདོངས་ལས་གདུགས་བྱས་ཤིང་། །རྟག་ཏུ་ལྷ་མོ་དེ་མཆོད་ན། །ཐམས་ཅད་དུས་སུ་འཇིག་རྟེན་སྐྱོབ། །
en: “If you continually make offerings to the goddess, Just as the humans in the borderlands do, Who make parasols from peacock feathers, Then she will protect the world at all times.

source: སྟག་དང་སེང་གེས་འཁོར་བྱས་ཤིང་། །བྱ་དང་ཕྱུགས་ཀྱང་དེ་ལ་བརྟན། །
en: “She is encircled by tigers and lions; Birds and cattle also depend on her.

source: དྲིལ་ཆེན་སྒྲ་དག་མངོན་བསྒྲགས་པས། །བིན་དྷུའི་རི་ལའང་གྲག་པར་གྱུར། །
en: When the sound of her great bell resounds It is heard even on the Vindhya mountains.

source: ཕྱག་ན་རྩེ་གསུམ་ཐོར་ཚུགས་དབུ། །ཡང་ན་ཉི་ཟླའི་རུ་མཚོན་བསྣམས། །
en: “In her hands she holds a trident, Or she holds the sun and moon as her standard.

source: ཟླ་བ་མར་ངོ་བཅུ་གཅིག་གམ། །དགུ་ཡི་དུས་སུ་མཆོད་པ་བྱ། །
en: On the eleventh day of the waning moon, Or on the ninth, make offerings to her.

source: གཡུལ་འགྱེད་དུས་སུ་ཐུགས་བརྩེ་བས། །འཇིག་རྟེན་ཀུན་ལ་གཟིགས་པའི་ཕྱིར། །ལྷ་མོ་བ་སུའི་གཟུགས་སྟོན་པས། །
en: “Because she looks upon the entire world, When a battle is being waged, through her kindness, She manifests as the goddess Vasu.

source: ལྷ་མོའི་མཆོག་སྟེ་དཔེ་མེད་པའོ། །
en: She is a supreme goddess beyond analogy.

source: ཕྱུགས་རྫི་རྒན་མོའི་གཟུགས་སྟོན་ཅིང་། །ལྷ་དག་འཐབ་པའང་རྟག་ཏུ་རྒྱལ། །
en: “She manifests the form of the gopi Rādhā, And even fighting devas, she is always victorious.

source: ཡུན་རིང་འཇིག་རྟེན་བདེ་བར་གནས། །བར་འགའ་ཁྲོས་ཤིང་བར་འགའ་ཞི། །
en: She dwells happily for a long time in the world, Sometimes wrathful, and sometimes peaceful.

source: བྲམ་ཟེར་སྨྲ་ཞིང་ཆོས་བཞི་དང་། །རྫུ་འཕྲུལ་གསང་སྔགས་ཀུན་ལ་མཁས། །
en: “She is skilled in the four Dharmas that are taught By the brahmins, and in all miracles and mantras.

source: དྲང་སྲོང་ལྷ་ཡི་དབང་བརྙེས་པས། །ས་ཆེན་འདི་དང་ས་བོན་བྱེད། །
en: She has attained the power of the ṛṣis and devas And creates this great earth and its seeds.

source: ལྷ་མོ་འདུ་བའི་དུས་སུ་ཡང་། །རྒྱ་མཚོ་ལུད་བཞིན་ངེས་པར་འདུ། །
en: “Also, when she gathers together goddesses, They come and gather like ocean waves.

source: གནོད་སྦྱིན་ཀླུ་ལ་སོགས་རྣམས་ཀྱིས། །ཀུན་གྱི་གཙོ་བྱེད་འདུལ་བར་ནུས། །
en: She is chief among all the assemblies of many yakṣas, nāgas, And so on, and she has the power to guide them.

source: མོ་རྣམས་ཀུན་གྱི་ཚངས་སྤྱོད་མཆོག །
en: “She is supreme among all female celibates.

source: འཇིག་རྟེན་གཙོ་སྦྱིན་བདག་ལ་དགོངས། །
en: She has power like a lord of the world.

source: རྒྱལ་པོའི་གནས་ལའང་པདྨོ་བཞིན། །ཆུ་བོ་ལ་ཡང་གྲུ་དང་གཟིངས། །
en: She is also like a lotus in a royal dwelling Or like a boat or ship on a river.

source: ཟླ་བ་ཉ་བཞིན་ཞལ་ཡང་རྒྱས། །
en: “Her wide face is like the full moon.

source: མང་དུ་ཐོས་ལྡན་རྟེན་ཡང་བྱེད། །
en: She is a support for scholars.

source: རི་བོའི་རྩེ་བཞིན་སྤོབས་པ་འཕགས། །བསམས་པས་གླིང་དང་རབ་ཀྱང་སྟོན། །
en: Her eloquence is as elevated as a mountain peak And she reveals a continent of contemplation.

source: ལྷ་མིན་ལ་སོགས་ལྷ་རྣམས་ཀྱིས། །ཀུན་གྱིས་ཡོན་ཏན་བསྟོད་ཅིང་བསྔགས། །
en: “The devas, such as the asuras and so on, All praise and extol her qualities.

source: སྤྱན་སྟོང་བརྒྱ་བྱིན་ལྷ་རྒྱལ་ཡང་། །གུས་པའི་སེམས་ཀྱིས་ཞལ་དུ་ལྟ། །
en: Even thousand-eyed Śakra, the king of devas, Gazes on her face with veneration.

source: སེམས་ཅན་གང་དག་ཅི་འདོད་པ། །དེ་ཀུན་བསམ་པ་མྱུར་དུ་སྐོང་། །
en: “Whatever it is that beings wish for, She quickly fulfills all those wishes.

source: བློ་མྱུར་ཐོས་པ་འཛིན་པ་ཡང་། །ས་ཆེན་འདི་གནས་ཀུན་གྱི་མཆོག །ཕྱོགས་བཅུའི་འཇིག་རྟེན་ཁམས་དག་ཏུ། །
en: She has a swift mind, retains what she hears, And is supreme over all on this great earth.

source: རྟག་ཏུ་སྒྲོན་ཆེན་སྣང་བྱེད་བཞིན། །
en: “She is always like a great illuminating lamp.

source: བྱ་དང་གཅན་གཟན་རི་དགས་ཀྱིའང་། །ཀུན་གྱི་བསམ་པ་ཡོངས་སུ་སྐོང་། །
en: In the world realms within the ten directions She even fulfills all the wishes of all Birds, carnivores, and herbivores.

source: བུད་མེད་ཀྱི་མཆོག་རི་བོ་བཞིན། །དྲང་སྲོང་འཇིག་རྟེན་རི་གནས་བཞིན། །ལྷ་མོ་གཞོན་བཞིན་འདོད་དང་བྲལ། །མི་མཇེད་བདག་བཞིན་བདེན་པར་སྨྲ། །
en: “She is like a mountain peak among females; Like the ṛṣis of the past, she remains for a long time; Like a young goddess, she is free of desire, And she speaks the truth like the Lord of Sahā.

source: འཇིག་རྟེན་མཐུན་པར་གཟུགས་སྟོན་ཅིང་། །
en: “You manifest a body that accords with the world.

source: འདོད་ཁམས་བར་གྱི་ལྷ་གནས་སུའང་། །ཁྱོད་ནི་ལྷ་མོའི་གཙོ་ཡིན་པས། །དེ་ལས་མཆོག་པའི་སེམས་ཅན་མེད། །
en: You are the chief among goddesses. Even in the paradises of the desire realm, There is no being that is greater.

source: གལ་ཏེ་གཡུལ་དང་འཇིགས་པའི་གནས། །མེ་ཡི་དོང་དུ་ལྷུང་འགྱུར་རམ། །ཆུ་བོ་གཡང་ས་མི་རྒོད་ལས། །འཇིགས་པ་དེ་ལས་སྒྲོལ་བར་མཛད། །
en: “She will save from the dangers Of battles and dangerous places, From falling into a pit of fire, And from rivers, crevasses, and savages.

source: རྒྱལ་པོའི་ཆད་པས་བཅིངས་པའམ། །ཡང་ན་དགྲ་ཡིས་བསད་པར་ཡང་། །རྩེ་གཅིག་སེམས་ནི་མ་གཡོས་ན། །སྡུག་བསྔལ་དག་ལས་ཐར་བར་འགྱུར། །
en: “Those who are bound in punishment by kings Or are being killed by an enemy, If their minds are one-pointed and unwavering, They will be freed from that suffering.

source: དགེ་དང་མི་དགེ་ཀུན་ལ་སྐྱོབ། །
en: “You protect all, the good and the bad.

source: བྱམས་དང་བརྩེ་བས་མདུན་དུ་གནས། །
en: You are present before them with love and affection.

source: དེ་ཕྱིར་བདག་ནི་སེམས་བཏུད་དེ། །ཕྱག་འཚལ་ལྷ་མོ་ཆེན་མོ་ལའོ། །
en: Therefore, in my mind I bow down And I pay homage to the great goddess.”

source: དེ་ནས་ཡང་སློབ་དཔོན་ལུང་སྟོན་པ་བྲམ་ཟེ་ཀཽཎྜི་ནྱས། ལྷ་མོ་ཆེན་མོ་དབྱངས་ཅན་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །འབྱུང་པོའི་ཚོགས་རྣམས་ཐམས་ཅད་ང་ལ་ཉན་པར་གྱིས། །
en: Then the Kauṇḍinya brahmin, the Dharma master Vyākaraṇa, praised the goddess Sarasvatī with these verses: “All hosts of spirits, listen to me!

source: ལྷ་དང་དྲི་ཟ་ལྷ་དབང་བཅས་པའི་འཇིག་རྟེན་ན། །བུད་མེད་དམ་པ་ལྷ་མོ་མཆོག་གི་རབ་གང་ཡིན། །ལྷ་མོ་དམ་པ་མཆོག་ཏུ་མཛེས་པའི་ཞལ་ལ་བསྟོད། །
en: I praise the perfectly beautiful face of the sublime goddess, The sublime female, the highest of perfect goddesses In the world with its devas, gandharvas, and lords of devas.

source: ཡོན་ཏན་རྣམ་པ་སྣ་ཚོགས་བསགས་པས་ཡན་ལག་བརྒྱན། །དབྱངས་ཅན་ཞེས་བྱ་སྤྱན་ནི་ཡངས་ཤིང་བསོད་ནམས་འབར། །
en: “The one named Sarasvatī is endowed with vast eyes. Her limbs are adorned by an accumulation of various qualities.

source: དྲི་མེད་ཡེ་ཤེས་ཡོན་ཏན་རྣམས་ཀྱིས་རྣམ་པར་བརྒྱན། །
en: She shines with merit, a vastness of stainless wisdom and qualities.

source: རིན་ཆེན་སྣ་ཚོགས་ཐ་དད་ལྟ་བུར་བལྟ་བའི་ཕྱིར། །
en: She is like a vision of an accumulation of different jewels.

source: མཆོག་རབ་ངག་གི་ཡོན་ཏན་ཁྱད་པར་དེ་བསྟོད་དོ། །
en: “I praise her, who has the exceptional qualities of supreme speech.

source: དམ་པ་མཆོག་གི་དངོས་གྲུབ་བྱེད་པ་དང་། །
en: She produces the supreme, sublime accomplishments.

source: ཡང་དག་བསྔགས་པ་ཡོན་ཏན་བྱེད་པ་དང་། །
en: She produces true praises and good qualities.

source: དྲི་མེད་མཆོག་དང་པདྨ་འབར་བ་དང་། །
en: She is stainlessly supreme, a shining lotus.

source: མིག་མཆོག་དང་ནི་མིག་གི་དམ་པ་དང་། །
en: “She has supreme eyes, sublime eyes.

source: དགེ་བའི་གནས་དང་དགེ་བ་མཐོང་བ་དང་། །
en: She is the basis for goodness, a vision of goodness.

source: ཡོན་ཏན་བསམ་མི་ཁྱབ་པས་བརྒྱན་པ་དང་། །
en: She is adorned with inconceivable qualities.

source: ཟླ་བ་འདྲ་དང་དྲི་མ་མེད་འོད་དང་། །
en: She is like the moon, shining with pure light.

source: ཡེ་ཤེས་འབྱུང་གནས་དྲན་པ་དམ་པ་དང་། །
en: “She is the source of wisdom and has sublime memory.

source: སེང་གེ་མཆོག་དང་མི་ལ་ཞོན་པ་དང་། །
en: She is a supreme lion, the divine steed of humans.

source: ལག་པ་བརྒྱད་རྣམས་ཀྱིས་ནི་བརྒྱན་པ་ལ། །མདའ་གཞུ་མདུང་ཐུང་རལ་གྲི་དགྲ་སྟ་དང་། །བེ་ཅོན་ལྕགས་ཀྱི་འཁོར་ལོ་ཞགས་པ་བསྣམས། །ཟླ་བ་ཉ་བ་ལྟ་བུར་སྣང་བའི་ཞལ། །
en: She is adorned with eight arms And she shines like the full moon.

source: ཡིད་དུ་འོང་བའི་ངག་དང་དབྱངས་སྙན་དང་། །
en: She has a beautiful voice and lovely speech.

source: ཤེས་རབ་ཟབ་མོ་དང་ནི་ལྡན་པ་དང་། །
en: She is endowed with profound wisdom.

source: དགོས་མཆོག་སྒྲུབ་བྱེད་སེམས་ཅན་དམ་པ་དང་། །
en: She is a sublime being who provides the highest needs.

source: ལྷ་དང་ལྷ་མིན་དབང་པོས་མཆོད་པ་དང་། །ལྷ་དང་ལྷ་མིན་ཚོགས་ཀུན་གནས་བརྗོད་དང་། །འབྱུང་པོའི་ཚོགས་ཀྱི་གནས་རྟག་མཆོད་པའི་ཕྱིར། །
en: Her abode is praised by all the hosts of deva and asura lords, And she is continually offered to by the hosts of spirits: svāhā.

source: སྭཱ་ཧཱ་བདག་ཅག་ལྷ་མོ་འདི་ལ་ཕྱག་བྱའོ། །
en: “I pay homage to this goddess.

source: བདག་ལ་ཡོན་ཏན་ཁྱད་པར་ཀུན་སྩོལ་ཅིག །
en: May she bestow special qualities on me.

source: དགོས་པ་ཀུན་ཏུ་བདག་ལ་དངོས་གྲུབ་སྩོལ། །
en: May she grant me the accomplishment of all that is needed.

source: དགྲ་རྣམས་ཁྲོད་ན་བདག་ལ་རྟག་ཏུ་སྲུངས། །
en: May she constantly protect me in the midst of enemies.

source: ཡི་གེ་རྫོགས་ཤིང་ཚིག་རྒྱས་འདི་དག་ནི། །ནང་པར་ལངས་ནས་གཙང་མར་བརྗོད་པར་བྱ། །བསམ་པ་དང་ནི་ནོར་འབྲུ་ཐམས་ཅད་རྙེད། །དངོས་གྲུབ་དགེ་བ་རྒྱ་ཆེན་ཐོབ་པར་འགྱུར། །
en: “In the morning, on arising, recite purely These complete syllables, the full words, And all wishes, wealth, and grain will be attained, And vast accomplishment and goodness will also be obtained.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྲམ་ཟེ་ཀཽཎྜི་ནྱ་ལ་ལེགས་སོ་ཞེས་བཀའ་སྩལ་ཏེ། ཁྱོད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བའི་ཕྱིར། ལྷ་མོ་དབྱངས་ཅན་ལ་བསྟོད་པ་དང་། དངོས་གྲུབ་དམ་པ་སློང་བས་བསོད་ནམས་ཚད་མེད་པ་དང་ལྡན་པར་འགྱུར་རོ།། །།བམ་པོ་བརྒྱད་པ། དེ་ནས་སློབ་དཔོན་ལུང་སྟོན་པ་བྲམ་ཟེ་ཀཽཎྜི་ནྱས་བསྟོད་པ་དང་། གསང་སྔགས་ཀྱི་ཚིག་གིས། ལྷ་མོ་ཆེན་མོ་དབྱངས་ཅན་ལ་གསོལ་ནས། ཡང་འཁོར་དེ་དག་ལ་སྨྲས་པ། སྐྱེས་བུ་ཁྱེད་ཀྱིས་ལྷ་མོ་དབྱངས་ཅན་སྤྱན་དྲང་བ་དང་། དེའི་ཐུགས་རྗེས་བསྐྱབ་ཅིང་། ཚེ་འདི་ཉིད་ལ་སྤོབས་པ་ཐོགས་པ་མེད་པ་དང་།
en: The Bhagavat then congratulated the Kauṇḍinya brahmin, saying, “It is excellent, excellent, that you, for the sake of the benefit and happiness of beings, have recited this praise to the goddess Sarasvatī and received sublime accomplishment so that you will possess immeasurable merit.”

source: ཐོས་པ་འཛིན་ཅིང་ཤེས་རབ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་བ་དང་། གཙུག་ལག་ཐམས་ཅད་ལ་མཁས་ཤིང་། ཚིག་སྦྱོར་བའི་རྒྱན་ལ་གསལ་ཞིང་ཐོགས་པ་མེད་པ་གྲུབ་པར་འདོད་པས། བསམ་པ་དེ་དེས་ཤིང་གུས་པའི་སེམས་ཀྱིས་ལྷ་མོ་དབྱངས་ཅན་སྤྱན་དྲང་བའི་ཚིག་འདི་བརྗོད་པར་བྱའོ། །སངས་རྒྱས་ལ་ཕྱག་འཚལ་ལོ། །
en: Then the Kauṇḍinya brahmin, the Dharma master Vyākaraṇa, having prayed to the great goddess Sarasvatī with words of praise and eulogy, said to the assembly, “If you wish to invite the goddess Sarasvatī, be protected by her compassion, have unimpeded eloquence in this life, possess what you have heard, have great wisdom, be skilled in all treatises, and accomplish clear and unimpeded in the adornments of composition, then with a respectful motivation and a reverential mind recite these words in order to invite the goddess Sarasvatī: “I pay homage to the Buddha.

source: ཆོས་ལ་ཕྱག་འཚལ་ལོ། །
en: I pay homage to the Dharma.

source: དགེ་འདུན་ལ་ཕྱག་འཚལ་ལོ། །བྱང་ཆུབ་སེམས་དཔའ་དང་།
en: I pay homage to the Saṅgha.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ལ་སོགས་པ། འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བཞུགས་པའི་འཕགས་པ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: “I pay homage to the bodhisattvas, śrāvakas, pratyekabuddhas, and all āryas of the past, future, and present.

source: ཕྱོགས་བཅུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཡང་དག་པར་བདེན་པའི་གསུང་ལ་གནས་པ། སོ་སོའི་དབང་པོ་དང་མཐུན་པ། བདེན་པ་སྟོན་པ་ལ་མི་སླུ་བར་གསུང་བ། བསྐལ་པ་བྱེ་བ་ཚད་མེད་པར་ཡང་དག་པར་བདེན་པའི་ཚིག་རྟག་ཏུ་སྟོན་ཅིང་། གསུང་བ་དེ་དག་ལ་རྗེས་སུ་ཡི་རང་ངོ་། །བདེན་པ་གསུང་བས་ལྗགས་ཡངས་ལ་རིང་བ་བཀྲམ་སྟེ། ཞལ་དང་འཛམ་བུའི་གླིང་དང་། རྒྱལ་ཆེན་བཞི་དང་།
en: “I rejoice in the speech of the bhagavats in the ten directions who remain in valid true speech, who are without deception, and who speak the teaching of the truth in accord with individual capacities and correctly teach the truth constantly for countless millions of eons.

source: སྟོང་གཅིག་དང་། སྟོང་གཉིས་དང་། སྟོང་གསུམ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་འདི་དང་། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་པ་ཐམས་ཅད་རྒྱས་པར་འགེངས་ཤིང་། ཉོན་མོངས་པའི་གདུང་བ་ཐམས་ཅད་སེལ་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ལ་ལུས་བཏུད་དེ་ཕྱག་འཚལ་ལོ། །
en: “I bow my body and pay homage to all the bhagavats who, in speaking the truth, spread their vast, long tongues, so that they completely cover their faces, Jambudvīpa, the Four Mahārājas, a chiliocosm, a dichiliocosm, a trichiliocosm, and all the countless world realms in the ten directions, dispelling all affliction from the defilements.

source: ལྗགས་ཀྱི་མཚན་དམ་པ་དེ་འདྲ་བ་དང་། སྤོབས་པ་ཚད་མེད་པ་དང་བདག་ལྡན་པར་གྱུར་ཅིག །ཕྱག་འཚལ་བཅོམ་ལྡན་དབྱངས་ཅན་མཆོག །བྱང་ཆུབ་ཆེན་པོ་དབྱངས་ཅན་མཆོག །འཕགས་པ་རང་རྒྱལ་དབྱངས་ཅན་མཆོག །ཟུང་བཞི་ཡ་བརྒྱད་དབྱངས་ཅན་མཆོག །བདེན་པ་བཞི་གསུང་དབྱངས་ཅན་མཆོག །ཡང་དག་གཟིགས་པ་དབྱངས་ཅན་མཆོག །དྲང་སྲོང་ཚངས་འཁོར་དབྱངས་ཅན་མཆོག །
en: “May I possess such a sublime sign of the tongue and limitless eloquence.

source: ལྷ་མོ་ཨུ་མ་དབྱངས་ཅན་མཆོག །སྐེམ་བྱེད་ལྷ་ཡང་དབྱངས་ཅན་མཆོག །གཟི་ཅན་ཀླུ་ཡང་དབྱངས་ཅན་མཆོག །མཚན་མོ་ལྷ་མོ་དབྱངས་ཅན་མཆོག །རྒྱལ་ཆེན་བཞི་པོ་དབྱངས་ཅན་མཆོག །བདེ་གནས་ལྷ་སྲས་དབྱངས་ཅན་མཆོག །རྡོ་རྗེ་གསང་བདག་དབྱངས་ཅན་མཆོག །ཁྱབ་འཇུག་ལྷ་ཡང་དབྱངས་ཅན་མཆོག །ལྷ་མོ་པེ་མ་དབྱངས་ཅན་མཆོག །ཚོགས་བདག་ལྷ་ཡང་དབྱངས་ཅན་མཆོག །དཔལ་གྱི་ལྷ་མོ་དབྱངས་ཅན་མཆོག །དཔལ་གྱི་བློ་གྲོས་དབྱངས་ཅན་མཆོག །ཧི་རི་ཚིག་འཆང་དབྱངས་ཅན་མཆོག །མ་མོ་ཀུན་མཆོག་དབྱངས་ཅན་མཆོག །འཕྲོག་མ་མོ་ཡང་དབྱངས་ཅན་མཆོག །གནོད་སྦྱིན་ཀུན་ཀྱང་དབྱངས་ཅན་མཆོག །ཕྱོགས་བཅུའི་རྒྱལ་པོ་དབྱངས་ཅན་མཆོག །
en: “I pay homage to the supreme eloquence of the Bhagavat; To the supreme eloquence of the great bodhisattvas; To the supreme eloquence of the ārya pratyekabuddhas; To the supreme eloquence of the four pairs and eight individuals; “To the supreme eloquence of the four truths; To the supreme eloquence of the true vision; To the supreme eloquence of the ṛṣis in Brahmā’s entourage; To the supreme eloquence of Umādevī; “To the supreme eloquence of the deity Skanda; To the supreme eloquence of the nāga Manasvin; To the supreme eloquence of the goddess of the night; To the supreme eloquence of the Four Mahārājas; “To the supreme eloquence of the devas in paradises; To the supreme eloquence of Vajra­guhyakādhipati; To the supreme eloquence of the deity Viṣṇu; To the supreme eloquence of the goddess Padmā; “To the supreme eloquence of the deity Ganeśa; To the supreme eloquence of the goddess Śrī; To the supreme eloquence of the goddess Śrīmatī; To the supreme eloquence of Haridhara; “To the supreme eloquence of all the mātṛkās; To the supreme eloquence of Hārītī; To the supreme eloquence of the yakṣas; To the supreme eloquence of the buddhas; And to the supreme eloquence of the jinas in the ten directions.

source: བདག་ལ་ལས་མཆོག་ཀུན་གྱིས་སྟོབས། །མཐའ་མེད་དབྱངས་ཅན་མཆོག་ཐོབ་མཛོད། །
en: “May I have power through all supreme actions And attain supreme, infinite eloquence.

source: སླུ་མེད་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: “I pay homage to the one who is infallible.

source: རྣམ་པར་གྲོལ་ལ་ཕྱག་འཚལ་ལོ། །
en: I pay homage to the one who is completely liberated.

source: འདོད་ཆགས་བྲལ་ལ་ཕྱག་འཚལ་ལོ། །
en: I pay homage to the one who is free of desire.

source: བཅིངས་པ་བཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: I pay homage to the one who has cut through bondage.

source: རྣམ་དག་སེམས་ལ་ཕྱག་འཚལ་ལོ། །
en: “I pay homage to the one with a pure mind.

source: འོད་སྣང་མཛད་ལ་ཕྱག་འཚལ་ལོ། །
en: I pay homage to the one who shines with light.

source: བདེན་ཚིག་གསུང་ལ་ཕྱག་འཚལ་ལོ། །
en: I pay homage to the speaker of true words.

source: རྡུལ་དང་བྲལ་ལ་ཕྱག་འཚལ་ལོ། །
en: I pay homage to the one who is free of dust.

source: དོན་དམ་གནས་ལ་ཕྱག་འཚལ་ལོ། །
en: “I pay homage to the one who dwells in the ultimate.

source: འཁོར་མང་གཙོ་ལ་ཕྱག་འཚལ་ལོ། །
en: I pay homage to the lord of the great assembly.

source: དབྱངས་ཅན་ལྷ་ལ་ཕྱག་འཚལ་ལོ། །
en: I pay homage to the goddess Sarasvatī.

source: བདག་ནི་ཚིག་ལ་ཐོགས་མེད་མཛོད། །བདག་གི་བསམ་པ་ཅི་མཆིས་པ། །ཐམས་ཅད་མྱུར་དུ་གྲུབ་པར་མཛོད། །
en: “Cause my words to be unimpeded And swiftly accomplish every one Of all the aspirations that I have.

source: ནད་མེད་རྟག་ཏུ་བདེ་བ་དང་། །ཚེ་རིང་བ་ཡང་ཐོབ་པར་ཤོག །
en: May I obtain health, constant happiness, And also may my lifetime be long.

source: རིག་པའི་གནས་ལ་མཁས་པ་དང་། །བྱང་ཆུབ་ལམ་ལ་བརྩོན་པ་དང་། །སྐྱེ་བོ་ཀུན་ལ་ཕན་མང་མཛོད། །རེ་བ་ཐམས་ཅད་མྱུར་དུ་སྐོང་། །
en: “Quickly fulfill every aspiration: Bring skill in all the branches of knowledge, Bring diligence on the path to enlightenment, And bring many benefits to all beings.

source: བདག་གི་ཡང་དག་བདེན་ཚིག་དང་། །བདག་གིས་མི་སླུ་ཚིག་སྨྲས་པ། །
en: “I speak the genuine words of truth And I speak infallible words.

source: དབྱངས་ཅན་ལྷ་མོ་མཆོག་གིས་ནི། །བདག་གི་དོན་དེ་གྲུབ་པར་མཛོད། །
en: May the supreme goddess Sarasvatī Cause my goals to be accomplished!

source: ལྷ་མོ་འདིར་ནི་གཤེགས་པར་གསོལ། །བདག་གི་ཚིག་ལ་ཐོགས་མེད་མཛོད། །
en: “I pray, goddess, that you come to this place And make my words free of impediment.

source: ལུས་དང་ངག་ལ་མྱུར་ཞུགས་ཤིང་། །ཡིད་མྱུར་སྤོབས་པ་རྫོགས་པར་མཛོད། །
en: Quickly enter my body and mouth And quickly perfect my mind’s eloquence.

source: བདག་གི་ལྕེ་ཡི་དབང་པོ་ལ། །བདེ་གཤེགས་སྤོབས་པ་ལྡན་པར་མཛོད། །
en: “Make the faculty of my tongue Have the eloquence of the tathāgatas.

source: ཚིག་གི་གཟི་བརྗིད་མཐུ་དེས་ནི། །སེམས་ཅན་ཐམས་ཅད་འདུལ་བར་མཛོད། །
en: Make me be a guide for beings Through the brilliance and power of my words.

source: བདག་གིས་ཚིག་ནི་ཅི་སྨྲས་པ། །དོན་དེ་ཐམས་ཅད་གྲུབ་པར་ཤོག །
en: “Whatever words there are that I speak, May all their meanings be accomplished!

source: ཚིག་ལ་ཐམས་ཅད་གུས་སྐྱེད་ཅིང་། །བྱེད་པ་ཐམས་ཅད་ཆུད་མ་གཟོན། །
en: May everyone have reverence for my words, And may all that I do not be wasted.

source: ནམ་ཞིག་བདག་གི་སྤོབས་འདོད་པ། །དོན་དེ་གྲུབ་པར་མ་གྱུར་ན། །ལྷ་མོ་ཁྱོད་ཀྱི་བདེན་ཚིག་ནི། །ཐམས་ཅད་བརྫུན་པ་ཉིད་དུ་འགྱུར། །
en: “If when I wish for eloquence That goal is not accomplished, Then, goddess, your words of truth Will all become nothing but lies.

source: མཚམས་མེད་ལྔ་ཡི་སྡིག་བགྱིས་པ། །སངས་རྒྱས་བཀས་ནི་འདུལ་བར་འགྱུར། །གང་ཡང་དགྲ་བཅོམ་པ་དག་དང་། །བྱས་པ་གཟོ་བའི་ཚིག་རྣམས་དང་། །
en: “Those who have created the bad karma with immediate result Will become guided by the Buddha’s words.

source: ཤཱ་རིའི་བུ་དང་མཽད་གལ་དང་། །བཅོམ་ལྡན་འཁོར་གྱི་གཙོ་བོ་སྟེ། །དེ་ལ་སོགས་པའི་བདེན་ཚིག་ཀྱང་། །ཐམས་ཅད་བདག་ལ་གྲུབ་པར་ཤོག །
en: The words of any arhat And the words of Kṛtajña, “And the words of truth of those such as Śāriputra and Maudgalyāyana, The leaders among the Bhagavat’s followers, May they all be accomplished by me.

source: སངས་རྒྱས་ཉན་ཐོས་འཁོར་རྣམས་དག །བདག་གིས་དེང་འདིར་སྤྱན་དྲང་གིས། །བདག་གི་རེ་བ་བསྐང་བའི་ཕྱིར། །ཐམས་ཅད་མྱུར་དུ་གཤེགས་པར་མཛོད། །
en: “On this day I invite to this place The Buddha and his assembly of disciples; May they all quickly come to this place So that my aspirations will be fulfilled.

source: ཡང་དག་བདེན་པའི་ཚིག་གསོལ་བ། །ཐམས་ཅད་སླུ་བ་མེད་པར་ཤོག །སྲིད་པའི་རྩེ་མོ་མན་ཆད་དང་། །གཙང་མའི་གནས་ནི་ཐམས་ཅད་དང་། །ཚངས་པ་ཚངས་ཆེན་མདུན་འདོན་དང་། །
en: “When I supplicate with valid words of truth May they all become infallible.

source: ཚངས་པའི་རྒྱལ་འཁོར་ཐམས་ཅད་དང་། །སྟོང་གསུམ་འཁོར་བའི་བར་དག་དང་། །མི་མཇེད་འཇིག་རྟེན་གཙོ་བོ་དང་། །དེ་དང་དེ་ཡི་འཁོར་རྣམས་དང་། །དེ་ཀུན་དེང་འདིར་སྤྱན་དྲངས་ཏེ། །
en: From the summit of existence down— Everyone in the Śuddhāvāsa paradises, “In all of the Brahmakāyika, Brahmapurohita, And Brahma­pariṣadya paradises, Throughout the circle of the trichiliocosm— The lord of the Sahā world “And all those in his entourage, All of them I invite here today.

source: ཐུགས་རྗེས་བདག་ལ་དགོངས་མཛད་ཅིང་། །བརྩེ་བ་ཀུན་གྱིས་གཟུང་བར་མཛོད། །གཞན་འཕྲུལ་དབང་བྱེད་ལྷ་དག་དང་། །གཞན་ཡང་འཕྲུལ་དགའི་ལྷ་དག་དང་། །བྱམས་པ་མངོན་པར་འཚང་རྒྱའི་གནས། །དགའ་ལྡན་གནམ་གྱི་ལྷ་རྣམས་དང་། །འཐབ་བྲལ་གྱི་ནི་ལྷ་རྣམས་དང་། །སུམ་ཅུ་རྩ་གསུམ་ལྷ་རྣམས་དང་། །རྒྱལ་ཆེན་བཞི་ཡི་ལྷ་རྣམས་དང་། །གཞན་ཡང་ལྷ་འཁོར་ཐམས་ཅད་དང་། །ས་ཆུ་མེ་རླུང་ལྷ་དག་དང་། །རི་རབ་ལྷུན་ལ་གནས་པ་དང་། །
en: Look upon me with compassion And completely take me into your loving care.
